module.exports = {
  mtData: mtData,
  searchmtdata: searchmtdata,
  noticeData:noticeData,
  newsData:newsData
}
var mt_data = mtData()
function searchmtdata(id) {
  var result
  for (let i = 0; i < mt_data.list.length; i++) {
    var mt = mt_data.list[i]
    if (mt.id == id) {
      result = mt
    }
  }
  return result || {}
}

function noticeData(){
  var arr={
    list:[{
      id: 0,
      pic: '/images/gg.png',
      title: '7月23日更新公告',
      summary: '安全组件更新',
      date: "2018/07/23"
    }, {
      id: 1,
      pic: '/images/gg.png',
      title: '7月22日更新公告',
      summary: '紧急维护补丁',
      date: "2018/07/22"
    },{
      id: 2,
      pic: '/images/gg.png',
      title: '7月22日更新公告',
      summary: '安全组件更新',
      date: "2018/07/22"
    },{
      id: 3,
      pic: '/images/gg.png',
      title: '7月21日更新公告',
      summary: '安全组件更新',
      date: "2018/07/21"
    }]
  }
  return arr
}

function newsData() {
  var arr = {
    list: [{
      id: 0,
      pic: 'http://www.puerzg.cn/d/file/p/2017-10-13/4fbbfa8a02cdf931612b3c640ed97670.png',
      title: '云南普洱：确保品质',
      summary: '茶园生态靠谱，质量有保证。',
      date: "2018-07-22"
    }, {
      id: 3,
      pic: 'http://www.puerzg.cn/d/file/journalism/Latest%20news/2018-07-16/e8c39d9ac8240b5fb33aec769f1850d7.jpg',
      title: '央视调查福建“天价茶”',
      summary: '关于“武夷岩茶”大家怎么看？',
      date: "2018-07-16"
    } , {
      id: 2,
      pic: 'http://www.puerzg.cn/d/file/puerchazhishi/lishiwenhua/2018-07-12/2a24335e4f43ea7dd68fc3fec9ca2455.jpg',
      title: '普洱茶最神奇的地方',
      summary: '普洱茶最神奇的地方是什么？',
      date: "2018-07-12"
    }, {
      id: 1,
      pic: 'http://www.puerzg.cn/d/file/zhuantizhuanqu/puerchashuchazhishizhuanti/2017-05-15/9c5adfbabd3294192fec078a64c528d8.jpg',
      title: '熟普洱茶为何有点黑',
      summary: '形成黑色的缘由有哪些呢？',
      date: "2017-05-15"
    }]
  }
  return arr
}

function mtData() {
  var arr = {
    list:{
      'notice':[{
        'title':'7月23日更新公告',
        'date':'2018/07/23',
        'time':'18:54:57',
        'content': '尊敬的用户，为了给各位用户带来更优质的软件体验，进一步加强软件的安全性，我们将于7月23日22:00进行停机维护，整个维护过程预计需要4小时30分钟。因停机给大家带来的不便，我们深表歉意。'
      }, {
        'title': '7月22日更新公告',
        'date': '2018/07/22',
        'time': '19:58:13',
        'content': '尊敬的用户,7月22日维护后，软件功能存在一些不稳定的情况，我们将会在7月22日20:30 - 22:00 期间对公会服务器进行临时维护。在维护期间，软件相关功能均不可用，由此给各位用户带来的不便我们深表歉意。'
      },{
        'title':'7月22日更新公告',
        'date':'2018/07/22',
        'time':'04:26:17',
        'content': '尊敬的用户，为了给各位用户带来更优质的软件体验，进一步加强软件的安全性，我们将于7月22日(周日)05: 00 - 9:00进行停机维护，整个维护过程预计需要4小时。因停机给大家带来的不便，我们深表歉意。'
      }, {
        'title': '7月21日更新公告',
        'date': '2018/07/21',
        'time': '20:29:21',
        'content': '尊敬的用户，为了给各位用户带来更优质的体验，进一步加强游戏的安全性，我们将于7月21日(周六)23: 00 - 7月22日(周日)1: 00对所有大区进行停机维护，整个维护过程预计需要2小时，因开机顺序以及数据维护内容差异，部分大区会提前开放。因停机给大家带来的不便，我们深表歉意。'
      }],
      'news': [{
        'title': '云南普洱：确保品质打造品牌',
        'date': '2018-07-22',
        'time': '14:48:48',
        'content': '据悉，普洱市下一步将按照“同一区域、同一产业、同一品牌、同一标签”要求，引导26座古茶山产地范围内的企业尽快成立诚信联盟，建立“有标识、有标准、有检测、有监控、可识别、可查询、可追溯、可信任”的产业联盟，将众多小企业集聚到区域品牌下，打造普洱市名山普洱茶全家福系列产品，形成集群抱团发展，共享品牌经济红利。'
      }, {
        'title': '熟普洱茶为何汤色有点黑',
        'date': '2017-05-15',
        'time': '16:38:33',
        'content': '假如是茶品自身的问题，那么呈现汤色像黑色的缘由之一，可能是茶品发酵水平重。熟茶常见汤色有红色、红亮、红浓、红褐、褐色、黑褐、黄白，熟茶的发酵水平到达8成时茶汤就曾经开端呈现黑褐色；熟茶发酵度到达9成时，茶汤黑色水平加深，茶汤整体呈浓厚的红褐偏黑色；当熟茶的发酵水平到达9成以上时，茶汤根本呈现为黑褐色。湿仓茶就较为容易呈现发酵水平重，茶汤颜色黑或者黑褐色的熟茶。'
      }, {
        'title': '普洱茶最神奇的地方是什么？',
        'date': '2018-07-12',
        'time': '14:18:26',
        'content': '初出茅庐的年轻人或许无法理解老茶背后的历史与悠远，耋耄老者也无法承受当年新茶的刺激性。茶品选择应同时顾及茶品的差异性与选择主体的差异性。由于普洱茶的兴盛，特别是饮陈茶的习惯兴起于近代，故而缺乏历史上对于普洱老茶品饮价值评价的极限数据。以目前积累的经验数据来看，制程正确的普洱茶，其品饮年限是超过人类平均寿命的。因此我们在当下讨论普洱茶的品饮期限时，应更多注意其茶种、制程、等因素对于茶品品质的影响。'
      }, {
        'title': '央视调查福建“天价茶”，关于“武夷岩茶”大家怎么看？',
        'date': '2018-07-16',
        'time': '11:57:18',
        'content': '庆幸的是，在央视这个专题报道出来之前，7月9日，武夷山市委办公室和市政府办公室联合印发《关于加强产销管理促进茶叶市场健康发展的实施意见》中，针对武夷岩茶市场中一些扰乱市场发展的现象已经出了具体的措施和打击、处理制度。'
      }]
    }
  }
  return arr
}